{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Convolution2D",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "batch_input_shape": [
                    null,
                    28,
                    28,
                    1
                ],
                "bias": true,
                "border_mode": "valid",
                "dim_ordering": "tf",
                "init": "glorot_uniform",
                "input_dtype": "float32",
                "name": "convolution2d_1",
                "nb_col": 3,
                "nb_filter": 32,
                "nb_row": 3,
                "subsample": [
                    1,
                    1
                ],
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_1",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_1",
                "p": 0.25,
                "trainable": true
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "flatten_1",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "init": "glorot_uniform",
                "input_dim": null,
                "name": "dense_1",
                "output_dim": 128,
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "relu",
                "name": "activation_2",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_2",
                "p": 0.5,
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "init": "glorot_uniform",
                "input_dim": null,
                "name": "dense_2",
                "output_dim": 91,
                "trainable": true
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "activation": "softmax",
                "name": "activation_3",
                "trainable": true
            }
        }
    ],
    "keras_version": "1.1.0"
}